In [60]:
import pandas as pd

In [61]:
data={'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Ravi', 'Natasha', 'Riya'],'Age':[17, 17, 18, 17, 18, 17, 17],'Gender': ['M', 'F', 'M', 'M', 'M', 'F', 'F'],'Marks': [90, 76, 'NaN', 74, 65, 'NaN', 71]}

In [62]:
df=pd.DataFrame(data)
df

      Name  Age Gender Marks
0      Jai   17      M    90
1   Princi   17      F    76
2   Gaurav   18      M   NaN
3     Anuj   17      M    74
4     Ravi   18      M    65
5  Natasha   17      F   NaN
6     Riya   17      F    71

In [63]:
avg=c=0
for i in df['Marks']:
    if str(i).isnumeric():
        c+=1
        avg+=i
avg=avg/c
print(avg)
df=df.replace(to_replace='NaN',value=avg)

75.2

In [64]:
print(df)

      Name  Age Gender  Marks
0      Jai   17      M   90.0
1   Princi   17      F   76.0
2   Gaurav   18      M   75.2
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F   75.2
6     Riya   17      F   71.0

In [65]:
df['Gender']=df['Gender'].map({'M':0,'F':1})
df

      Name  Age  Gender  Marks
0      Jai   17       0   90.0
1   Princi   17       1   76.0
2   Gaurav   18       0   75.2
3     Anuj   17       0   74.0
4     Ravi   18       0   65.0
5  Natasha   17       1   75.2
6     Riya   17       1   71.0

In [70]:
df[df['Marks']>=75].drop(['Age'],axis=1)

      Name  Gender  Marks
0      Jai       0   90.0
1   Princi       1   76.0
2   Gaurav       0   75.2
5  Natasha       1   75.2